snob15zp/GERMO_PD/CG-PD140-Firmware-CODE-version-1-2/CG-PD140INF_v0.2/mtb_shared/mtb-hal-cat2/release-v2.0.0/COMPONENT_CAT2/source/pin_packages/cyhal_psoc4100smax_100_tqfp.c
/***************************************************************************//**
* \file cyhal_psoc4100smax_100_tqfp.c
*
* \brief
* PSoC4100Smax device GPIO HAL header for 100-TQFP package
*
********************************************************************************
* \copyright
* (c) (2016-2021), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device_headers.h"
#include "cyhal_hw_types.h"

#if defined(_GPIO_PSOC4100SMAX_100_TQFP_H_)
#include "pin_packages/cyhal_psoc4100smax_100_tqfp.h"

/* Pin connections */
/* Connections for: audioss_clk_i2s_if */
const cyhal_resource_pin_mapping_t cyhal_pin_map_audioss_clk_i2s_if[4] = {
    {0u, 0u, P2_7, P2_7_AUDIOSS_CLK_I2S_IF},
    {0u, 0u, P3_0, P3_0_AUDIOSS_CLK_I2S_IF},
    {0u, 0u, P7_3, P7_3_AUDIOSS_CLK_I2S_IF},
    {0u, 0u, P8_0, P8_0_AUDIOSS_CLK_I2S_IF},
};

/* Connections for: audioss_tx_sck */
const cyhal_resource_pin_mapping_t cyhal_pin_map_audioss_tx_sck[4] = {
    {0u, 0u, P2_4, P2_4_AUDIOSS_TX_SCK},
    {0u, 0u, P3_5, P3_5_AUDIOSS_TX_SCK},
    {0u, 0u, P7_4, P7_4_AUDIOSS_TX_SCK},
    {0u, 0u, P8_1, P8_1_AUDIOSS_TX_SCK},
};

/* Connections for: audioss_tx_sdo */
const cyhal_resource_pin_mapping_t cyhal_pin_map_audioss_tx_sdo[4] = {
    {0u, 0u, P2_6, P2_6_AUDIOSS_TX_SDO},
    {0u, 0u, P3_6, P3_6_AUDIOSS_TX_SDO},
    {0u, 0u, P7_5, P7_5_AUDIOSS_TX_SDO},
    {0u, 0u, P8_3, P8_3_AUDIOSS_TX_SDO},
};

/* Connections for: audioss_tx_ws */
const cyhal_resource_pin_mapping_t cyhal_pin_map_audioss_tx_ws[4] = {
    {0u, 0u, P2_5, P2_5_AUDIOSS_TX_WS},
    {0u, 0u, P3_7, P3_7_AUDIOSS_TX_WS},
    {0u, 0u, P7_6, P7_6_AUDIOSS_TX_WS},
    {0u, 0u, P8_2, P8_2_AUDIOSS_TX_WS},
};

/* Connections for: canfd_ttcan_rx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_canfd_ttcan_rx[4] = {
    {0u, 0u, P0_2, P0_2_CANFD_TTCAN_RX0},
    {0u, 0u, P6_1, P6_1_CANFD_TTCAN_RX0},
    {0u, 0u, P9_0, P9_0_CANFD_TTCAN_RX0},
    {0u, 0u, P10_4, P10_4_CANFD_TTCAN_RX0},
};

/* Connections for: canfd_ttcan_tx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_canfd_ttcan_tx[4] = {
    {0u, 0u, P0_3, P0_3_CANFD_TTCAN_TX0},
    {0u, 0u, P6_2, P6_2_CANFD_TTCAN_TX0},
    {0u, 0u, P9_1, P9_1_CANFD_TTCAN_TX0},
    {0u, 0u, P10_5, P10_5_CANFD_TTCAN_TX0},
};

/* Connections for: lpcomp_dsi_comp */
const cyhal_resource_pin_mapping_t cyhal_pin_map_lpcomp_dsi_comp[8] = {
    {0u, 0u, P2_7, P2_7_LPCOMP_COMP0},
    {0u, 1u, P3_7, P3_7_LPCOMP_COMP1},
    {0u, 0u, P4_2, P4_2_LPCOMP_COMP0},
    {0u, 1u, P4_3, P4_3_LPCOMP_COMP1},
    {0u, 0u, P5_2, P5_2_LPCOMP_COMP0},
    {0u, 1u, P5_3, P5_3_LPCOMP_COMP1},
    {0u, 0u, P8_2, P8_2_LPCOMP_COMP0},
    {0u, 1u, P8_3, P8_3_LPCOMP_COMP1},
};

/* Connections for: lpcomp_inn_comp */
const cyhal_resource_pin_mapping_t cyhal_pin_map_lpcomp_inn_comp[2] = {
    {0u, 0u, P0_1, HSIOM_SEL_GPIO},
    {0u, 1u, P0_3, HSIOM_SEL_GPIO},
};

/* Connections for: lpcomp_inp_comp */
const cyhal_resource_pin_mapping_t cyhal_pin_map_lpcomp_inp_comp[2] = {
    {0u, 0u, P0_0, HSIOM_SEL_GPIO},
    {0u, 1u, P0_2, HSIOM_SEL_GPIO},
};

/* Connections for: opamp_dsi_ctb_cmp */
const cyhal_resource_pin_mapping_t cyhal_pin_map_opamp_dsi_ctb_cmp[2] = {
    {0u, 0u, P3_6, P3_6_PASS0_DSI_CTB_CMP0},
    {0u, 1u, P3_7, P3_7_PASS0_DSI_CTB_CMP1},
};

/* Connections for: opamp_out_10x */
const cyhal_resource_pin_mapping_t cyhal_pin_map_opamp_out_10x[2] = {
    {0u, 0u, P1_2, HSIOM_SEL_GPIO},
    {0u, 1u, P1_3, HSIOM_SEL_GPIO},
};

/* Connections for: opamp_vin_m */
const cyhal_resource_pin_mapping_t cyhal_pin_map_opamp_vin_m[2] = {
    {0u, 0u, P1_1, HSIOM_SEL_GPIO},
    {0u, 1u, P1_4, HSIOM_SEL_GPIO},
};

/* Connections for: opamp_vin_p0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_opamp_vin_p0[2] = {
    {0u, 0u, P1_0, HSIOM_SEL_GPIO},
    {0u, 1u, P1_5, HSIOM_SEL_GPIO},
};

/* Connections for: opamp_vin_p1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_opamp_vin_p1[2] = {
    {0u, 0u, P1_6, HSIOM_SEL_GPIO},
    {0u, 1u, P1_7, HSIOM_SEL_GPIO},
};

/* Connections for: pass_dsi_sar_data */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_dsi_sar_data[12] = {
    {0u, 2u, P0_3, P0_3_PASS0_DSI_SAR_DATA2},
    {0u, 0u, P0_4, P0_4_PASS0_DSI_SAR_DATA0},
    {0u, 1u, P0_5, P0_5_PASS0_DSI_SAR_DATA1},
    {0u, 3u, P1_2, P1_2_PASS0_DSI_SAR_DATA3},
    {0u, 4u, P1_3, P1_3_PASS0_DSI_SAR_DATA4},
    {0u, 5u, P2_6, P2_6_PASS0_DSI_SAR_DATA5},
    {0u, 6u, P2_7, P2_7_PASS0_DSI_SAR_DATA6},
    {0u, 7u, P3_0, P3_0_PASS0_DSI_SAR_DATA7},
    {0u, 8u, P3_1, P3_1_PASS0_DSI_SAR_DATA8},
    {0u, 9u, P4_0, P4_0_PASS0_DSI_SAR_DATA9},
    {0u, 10u, P4_2, P4_2_PASS0_DSI_SAR_DATA10},
    {0u, 11u, P4_3, P4_3_PASS0_DSI_SAR_DATA11},
};

/* Connections for: pass_dsi_sar_data_valid */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_dsi_sar_data_valid[1] = {
    {0u, 0u, P0_0, P0_0_PASS0_DSI_SAR_DATA_VALID},
};

/* Connections for: pass_dsi_sar_sample_done */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_dsi_sar_sample_done[1] = {
    {0u, 0u, P0_2, P0_2_PASS0_DSI_SAR_SAMPLE_DONE},
};

/* Connections for: pass_sar_ext_vref0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_sar_ext_vref0[1] = {
    {0u, 0u, P1_7, HSIOM_SEL_GPIO},
};

/* Connections for: pass_sar_ext_vref1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_sar_ext_vref1[1] = {
    {0u, 0u, P1_7, HSIOM_SEL_GPIO},
};

/* Connections for: pass_sarmux_pads */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_sarmux_pads[8] = {
    {0u, 0u, P2_0, HSIOM_SEL_GPIO},
    {0u, 1u, P2_1, HSIOM_SEL_GPIO},
    {0u, 2u, P2_2, HSIOM_SEL_GPIO},
    {0u, 3u, P2_3, HSIOM_SEL_GPIO},
    {0u, 4u, P2_4, HSIOM_SEL_GPIO},
    {0u, 5u, P2_5, HSIOM_SEL_GPIO},
    {0u, 6u, P2_6, HSIOM_SEL_GPIO},
    {0u, 7u, P2_7, HSIOM_SEL_GPIO},
};

