snob15zp/GERMO_PD/CG-PD140-Firmware-CODE-version-1-2/CG-PD140INF_v0.2/mtb_shared/mtb-hal-cat2/release-v2.0.0/COMPONENT_CAT2/source/pin_packages/cyhal_psoc4100smax_100_tqfp.c
/* Connections for: pass_tr_sar_out */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_tr_sar_out[1] = {
    {0u, 0u, P0_1, P0_1_PASS0_TR_SAR_OUT},
};

/* Connections for: scb_i2c_scl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_i2c_scl[16] = {
    {2u, 0u, P0_0, P0_0_SCB2_I2C_SCL},
    {1u, 0u, P0_4, P0_4_SCB1_I2C_SCL},
    {0u, 0u, P1_0, P1_0_SCB0_I2C_SCL},
    {2u, 0u, P1_2, P1_2_SCB2_I2C_SCL},
    {3u, 0u, P1_4, P1_4_SCB3_I2C_SCL},
    {1u, 0u, P2_0, P2_0_SCB1_I2C_SCL},
    {1u, 0u, P3_0, P3_0_SCB1_I2C_SCL},
    {0u, 0u, P4_0, P4_0_SCB0_I2C_SCL},
    {2u, 0u, P5_0, P5_0_SCB2_I2C_SCL},
    {3u, 0u, P6_0, P6_0_SCB3_I2C_SCL},
    {4u, 0u, P6_4, P6_4_SCB4_I2C_SCL},
    {3u, 0u, P7_0, P7_0_SCB3_I2C_SCL},
    {4u, 0u, P8_0, P8_0_SCB4_I2C_SCL},
    {0u, 0u, P9_0, P9_0_SCB0_I2C_SCL},
    {2u, 0u, P10_0, P10_0_SCB2_I2C_SCL},
    {1u, 0u, P12_0, P12_0_SCB1_I2C_SCL},
};

/* Connections for: scb_i2c_sda */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_i2c_sda[16] = {
    {2u, 0u, P0_1, P0_1_SCB2_I2C_SDA},
    {1u, 0u, P0_5, P0_5_SCB1_I2C_SDA},
    {0u, 0u, P1_1, P1_1_SCB0_I2C_SDA},
    {2u, 0u, P1_3, P1_3_SCB2_I2C_SDA},
    {3u, 0u, P1_5, P1_5_SCB3_I2C_SDA},
    {1u, 0u, P2_1, P2_1_SCB1_I2C_SDA},
    {1u, 0u, P3_1, P3_1_SCB1_I2C_SDA},
    {0u, 0u, P4_1, P4_1_SCB0_I2C_SDA},
    {2u, 0u, P5_1, P5_1_SCB2_I2C_SDA},
    {3u, 0u, P6_1, P6_1_SCB3_I2C_SDA},
    {4u, 0u, P6_5, P6_5_SCB4_I2C_SDA},
    {3u, 0u, P7_1, P7_1_SCB3_I2C_SDA},
    {4u, 0u, P8_1, P8_1_SCB4_I2C_SDA},
    {0u, 0u, P9_1, P9_1_SCB0_I2C_SDA},
    {2u, 0u, P10_1, P10_1_SCB2_I2C_SDA},
    {1u, 0u, P12_1, P12_1_SCB1_I2C_SDA},
};

/* Connections for: scb_spi_m_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_clk[15] = {
    {1u, 0u, P0_6, P0_6_SCB1_SPI_CLK},
    {0u, 0u, P1_2, P1_2_SCB0_SPI_CLK},
    {2u, 0u, P1_7, P1_7_SCB2_SPI_CLK},
    {1u, 0u, P2_2, P2_2_SCB1_SPI_CLK},
    {1u, 0u, P3_2, P3_2_SCB1_SPI_CLK},
    {0u, 0u, P4_2, P4_2_SCB0_SPI_CLK},
    {4u, 0u, P4_6, P4_6_SCB4_SPI_CLK},
    {2u, 0u, P5_2, P5_2_SCB2_SPI_CLK},
    {3u, 0u, P6_2, P6_2_SCB3_SPI_CLK},
    {3u, 0u, P7_2, P7_2_SCB3_SPI_CLK},
    {3u, 0u, P8_2, P8_2_SCB3_SPI_CLK},
    {0u, 0u, P9_2, P9_2_SCB0_SPI_CLK},
    {2u, 0u, P10_2, P10_2_SCB2_SPI_CLK},
    {1u, 0u, P11_2, P11_2_SCB1_SPI_CLK},
    {4u, 0u, P11_2, P11_2_SCB4_SPI_CLK},
};

/* Connections for: scb_spi_m_miso */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_miso[15] = {
    {1u, 0u, P0_5, P0_5_SCB1_SPI_MISO},
    {0u, 0u, P1_1, P1_1_SCB0_SPI_MISO},
    {1u, 0u, P2_1, P2_1_SCB1_SPI_MISO},
    {1u, 0u, P3_1, P3_1_SCB1_SPI_MISO},
    {2u, 0u, P3_7, P3_7_SCB2_SPI_MISO},
    {0u, 0u, P4_1, P4_1_SCB0_SPI_MISO},
    {4u, 0u, P4_5, P4_5_SCB4_SPI_MISO},
    {2u, 0u, P5_1, P5_1_SCB2_SPI_MISO},
    {3u, 0u, P6_1, P6_1_SCB3_SPI_MISO},
    {3u, 0u, P7_1, P7_1_SCB3_SPI_MISO},
    {3u, 0u, P8_1, P8_1_SCB3_SPI_MISO},
    {0u, 0u, P9_1, P9_1_SCB0_SPI_MISO},
    {2u, 0u, P10_1, P10_1_SCB2_SPI_MISO},
    {1u, 0u, P11_1, P11_1_SCB1_SPI_MISO},
    {4u, 0u, P11_1, P11_1_SCB4_SPI_MISO},
};

/* Connections for: scb_spi_m_mosi */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_mosi[15] = {
    {1u, 0u, P0_4, P0_4_SCB1_SPI_MOSI},
    {0u, 0u, P1_0, P1_0_SCB0_SPI_MOSI},
    {1u, 0u, P2_0, P2_0_SCB1_SPI_MOSI},
    {2u, 0u, P2_7, P2_7_SCB2_SPI_MOSI},
    {1u, 0u, P3_0, P3_0_SCB1_SPI_MOSI},
    {0u, 0u, P4_0, P4_0_SCB0_SPI_MOSI},
    {4u, 0u, P4_4, P4_4_SCB4_SPI_MOSI},
    {2u, 0u, P5_0, P5_0_SCB2_SPI_MOSI},
    {3u, 0u, P6_0, P6_0_SCB3_SPI_MOSI},
    {3u, 0u, P7_0, P7_0_SCB3_SPI_MOSI},
    {3u, 0u, P8_0, P8_0_SCB3_SPI_MOSI},
    {0u, 0u, P9_0, P9_0_SCB0_SPI_MOSI},
    {2u, 0u, P10_0, P10_0_SCB2_SPI_MOSI},
    {1u, 0u, P11_0, P11_0_SCB1_SPI_MOSI},
    {4u, 0u, P11_0, P11_0_SCB4_SPI_MOSI},
};

/* Connections for: scb_spi_m_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select0[15] = {
    {2u, 0u, P0_3, P0_3_SCB2_SPI_SELECT0},
    {1u, 0u, P0_7, P0_7_SCB1_SPI_SELECT0},
    {0u, 0u, P1_3, P1_3_SCB0_SPI_SELECT0},
    {1u, 0u, P2_3, P2_3_SCB1_SPI_SELECT0},
    {1u, 0u, P3_3, P3_3_SCB1_SPI_SELECT0},
    {0u, 0u, P4_3, P4_3_SCB0_SPI_SELECT0},
    {4u, 0u, P4_7, P4_7_SCB4_SPI_SELECT0},
    {2u, 0u, P5_3, P5_3_SCB2_SPI_SELECT0},
    {3u, 0u, P6_3, P6_3_SCB3_SPI_SELECT0},
    {3u, 0u, P7_4, P7_4_SCB3_SPI_SELECT0},
    {3u, 0u, P8_3, P8_3_SCB3_SPI_SELECT0},
    {0u, 0u, P9_3, P9_3_SCB0_SPI_SELECT0},
    {2u, 0u, P10_3, P10_3_SCB2_SPI_SELECT0},
    {1u, 0u, P11_3, P11_3_SCB1_SPI_SELECT0},
    {4u, 0u, P11_3, P11_3_SCB4_SPI_SELECT0},
};

/* Connections for: scb_spi_m_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select1[13] = {
    {0u, 0u, P0_0, P0_0_SCB0_SPI_SELECT1},
    {0u, 0u, P1_4, P1_4_SCB0_SPI_SELECT1},
    {1u, 0u, P2_4, P2_4_SCB1_SPI_SELECT1},
    {1u, 0u, P3_4, P3_4_SCB1_SPI_SELECT1},
    {0u, 0u, P4_4, P4_4_SCB0_SPI_SELECT1},
    {2u, 0u, P5_4, P5_4_SCB2_SPI_SELECT1},
    {4u, 0u, P5_6, P5_6_SCB4_SPI_SELECT1},
    {3u, 0u, P5_7, P5_7_SCB3_SPI_SELECT1},
    {3u, 0u, P6_4, P6_4_SCB3_SPI_SELECT1},
    {3u, 0u, P7_5, P7_5_SCB3_SPI_SELECT1},
    {2u, 0u, P10_4, P10_4_SCB2_SPI_SELECT1},
    {1u, 0u, P11_4, P11_4_SCB1_SPI_SELECT1},
    {4u, 0u, P11_4, P11_4_SCB4_SPI_SELECT1},
};

/* Connections for: scb_spi_m_select2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select2[13] = {
    {0u, 0u, P0_1, P0_1_SCB0_SPI_SELECT2},
    {0u, 0u, P1_5, P1_5_SCB0_SPI_SELECT2},
    {1u, 0u, P2_5, P2_5_SCB1_SPI_SELECT2},
    {1u, 0u, P3_5, P3_5_SCB1_SPI_SELECT2},
    {0u, 0u, P4_5, P4_5_SCB0_SPI_SELECT2},
    {3u, 0u, P4_7, P4_7_SCB3_SPI_SELECT2},
    {2u, 0u, P5_5, P5_5_SCB2_SPI_SELECT2},
    {4u, 0u, P5_7, P5_7_SCB4_SPI_SELECT2},
    {3u, 0u, P6_5, P6_5_SCB3_SPI_SELECT2},
    {3u, 0u, P7_3, P7_3_SCB3_SPI_SELECT2},
    {2u, 0u, P10_5, P10_5_SCB2_SPI_SELECT2},
    {1u, 0u, P11_5, P11_5_SCB1_SPI_SELECT2},
    {4u, 0u, P11_5, P11_5_SCB4_SPI_SELECT2},
};

/* Connections for: scb_spi_m_select3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select3[9] = {
    {0u, 0u, P0_2, P0_2_SCB0_SPI_SELECT3},
    {0u, 0u, P1_6, P1_6_SCB0_SPI_SELECT3},
    {1u, 0u, P2_6, P2_6_SCB1_SPI_SELECT3},
    {1u, 0u, P3_6, P3_6_SCB1_SPI_SELECT3},
    {4u, 0u, P3_6, P3_6_SCB4_SPI_SELECT3},
    {0u, 0u, P4_6, P4_6_SCB0_SPI_SELECT3},
    {2u, 0u, P5_6, P5_6_SCB2_SPI_SELECT3},
    {3u, 0u, P7_6, P7_6_SCB3_SPI_SELECT3},
    {3u, 0u, P12_0, P12_0_SCB3_SPI_SELECT3},
};

/* Connections for: scb_spi_s_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_s_clk[15] = {
    {1u, 0u, P0_6, P0_6_SCB1_SPI_CLK},
    {0u, 0u, P1_2, P1_2_SCB0_SPI_CLK},
    {2u, 0u, P1_7, P1_7_SCB2_SPI_CLK},
    {1u, 0u, P2_2, P2_2_SCB1_SPI_CLK},
    {1u, 0u, P3_2, P3_2_SCB1_SPI_CLK},
    {0u, 0u, P4_2, P4_2_SCB0_SPI_CLK},
    {4u, 0u, P4_6, P4_6_SCB4_SPI_CLK},
    {2u, 0u, P5_2, P5_2_SCB2_SPI_CLK},
    {3u, 0u, P6_2, P6_2_SCB3_SPI_CLK},
    {3u, 0u, P7_2, P7_2_SCB3_SPI_CLK},
    {3u, 0u, P8_2, P8_2_SCB3_SPI_CLK},
    {0u, 0u, P9_2, P9_2_SCB0_SPI_CLK},
    {2u, 0u, P10_2, P10_2_SCB2_SPI_CLK},
    {1u, 0u, P11_2, P11_2_SCB1_SPI_CLK},
    {4u, 0u, P11_2, P11_2_SCB4_SPI_CLK},
};

/* Connections for: scb_spi_s_miso */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_s_miso[15] = {
    {1u, 0u, P0_5, P0_5_SCB1_SPI_MISO},
    {0u, 0u, P1_1, P1_1_SCB0_SPI_MISO},
    {1u, 0u, P2_1, P2_1_SCB1_SPI_MISO},
    {1u, 0u, P3_1, P3_1_SCB1_SPI_MISO},
    {2u, 0u, P3_7, P3_7_SCB2_SPI_MISO},
    {0u, 0u, P4_1, P4_1_SCB0_SPI_MISO},
    {4u, 0u, P4_5, P4_5_SCB4_SPI_MISO},
    {2u, 0u, P5_1, P5_1_SCB2_SPI_MISO},
    {3u, 0u, P6_1, P6_1_SCB3_SPI_MISO},
    {3u, 0u, P7_1, P7_1_SCB3_SPI_MISO},
    {3u, 0u, P8_1, P8_1_SCB3_SPI_MISO},
    {0u, 0u, P9_1, P9_1_SCB0_SPI_MISO},
    {2u, 0u, P10_1, P10_1_SCB2_SPI_MISO},
    {1u, 0u, P11_1, P11_1_SCB1_SPI_MISO},
    {4u, 0u, P11_1, P11_1_SCB4_SPI_MISO},
};

