snob15zp/GERMO_PD/CG-PD140-Firmware-CODE-version-1-2/CG-PD140INF_v0.2/mtb_shared/mtb-hal-cat2/release-v2.0.0/COMPONENT_CAT2/source/pin_packages/cyhal_psoc4100smax_100_tqfp.c
/* Connections for: tcpwm_line */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line[36] = {
    {0u, 0u, P0_7, P0_7_TCPWM_LINE0},
    {0u, 2u, P1_0, P1_0_TCPWM_LINE2},
    {0u, 3u, P1_2, P1_2_TCPWM_LINE3},
    {0u, 6u, P1_4, P1_4_TCPWM_LINE6},
    {0u, 7u, P1_6, P1_6_TCPWM_LINE7},
    {0u, 4u, P2_0, P2_0_TCPWM_LINE4},
    {0u, 5u, P2_2, P2_2_TCPWM_LINE5},
    {0u, 0u, P2_4, P2_4_TCPWM_LINE0},
    {0u, 1u, P2_6, P2_6_TCPWM_LINE1},
    {0u, 0u, P3_0, P3_0_TCPWM_LINE0},
    {0u, 1u, P3_2, P3_2_TCPWM_LINE1},
    {0u, 2u, P3_4, P3_4_TCPWM_LINE2},
    {0u, 3u, P3_6, P3_6_TCPWM_LINE3},
    {0u, 6u, P4_6, P4_6_TCPWM_LINE6},
    {0u, 4u, P5_0, P5_0_TCPWM_LINE4},
    {0u, 5u, P5_2, P5_2_TCPWM_LINE5},
    {0u, 6u, P5_4, P5_4_TCPWM_LINE6},
    {0u, 7u, P5_6, P5_6_TCPWM_LINE7},
    {0u, 4u, P6_0, P6_0_TCPWM_LINE4},
    {0u, 5u, P6_2, P6_2_TCPWM_LINE5},
    {0u, 6u, P6_4, P6_4_TCPWM_LINE6},
    {0u, 0u, P7_0, P7_0_TCPWM_LINE0},
    {0u, 1u, P7_2, P7_2_TCPWM_LINE1},
    {0u, 2u, P7_4, P7_4_TCPWM_LINE2},
    {0u, 3u, P7_6, P7_6_TCPWM_LINE3},
    {0u, 4u, P8_0, P8_0_TCPWM_LINE4},
    {0u, 5u, P8_2, P8_2_TCPWM_LINE5},
    {0u, 0u, P9_0, P9_0_TCPWM_LINE0},
    {0u, 1u, P9_2, P9_2_TCPWM_LINE1},
    {0u, 7u, P10_0, P10_0_TCPWM_LINE7},
    {0u, 2u, P10_2, P10_2_TCPWM_LINE2},
    {0u, 3u, P10_4, P10_4_TCPWM_LINE3},
    {0u, 4u, P11_0, P11_0_TCPWM_LINE4},
    {0u, 5u, P11_2, P11_2_TCPWM_LINE5},
    {0u, 6u, P11_4, P11_4_TCPWM_LINE6},
    {0u, 7u, P12_0, P12_0_TCPWM_LINE7},
};

/* Connections for: tcpwm_line_compl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line_compl[35] = {
    {0u, 2u, P1_1, P1_1_TCPWM_LINE_COMPL2},
    {0u, 3u, P1_3, P1_3_TCPWM_LINE_COMPL3},
    {0u, 6u, P1_5, P1_5_TCPWM_LINE_COMPL6},
    {0u, 7u, P1_7, P1_7_TCPWM_LINE_COMPL7},
    {0u, 4u, P2_1, P2_1_TCPWM_LINE_COMPL4},
    {0u, 5u, P2_3, P2_3_TCPWM_LINE_COMPL5},
    {0u, 0u, P2_5, P2_5_TCPWM_LINE_COMPL0},
    {0u, 1u, P2_7, P2_7_TCPWM_LINE_COMPL1},
    {0u, 0u, P3_1, P3_1_TCPWM_LINE_COMPL0},
    {0u, 1u, P3_3, P3_3_TCPWM_LINE_COMPL1},
    {0u, 2u, P3_5, P3_5_TCPWM_LINE_COMPL2},
    {0u, 3u, P3_7, P3_7_TCPWM_LINE_COMPL3},
    {0u, 6u, P4_7, P4_7_TCPWM_LINE_COMPL6},
    {0u, 4u, P5_1, P5_1_TCPWM_LINE_COMPL4},
    {0u, 5u, P5_3, P5_3_TCPWM_LINE_COMPL5},
    {0u, 6u, P5_5, P5_5_TCPWM_LINE_COMPL6},
    {0u, 7u, P5_7, P5_7_TCPWM_LINE_COMPL7},
    {0u, 4u, P6_1, P6_1_TCPWM_LINE_COMPL4},
    {0u, 5u, P6_3, P6_3_TCPWM_LINE_COMPL5},
    {0u, 6u, P6_5, P6_5_TCPWM_LINE_COMPL6},
    {0u, 0u, P7_1, P7_1_TCPWM_LINE_COMPL0},
    {0u, 1u, P7_3, P7_3_TCPWM_LINE_COMPL1},
    {0u, 2u, P7_5, P7_5_TCPWM_LINE_COMPL2},
    {0u, 3u, P7_7, P7_7_TCPWM_LINE_COMPL3},
    {0u, 4u, P8_1, P8_1_TCPWM_LINE_COMPL4},
    {0u, 5u, P8_3, P8_3_TCPWM_LINE_COMPL5},
    {0u, 0u, P9_1, P9_1_TCPWM_LINE_COMPL0},
    {0u, 1u, P9_3, P9_3_TCPWM_LINE_COMPL1},
    {0u, 7u, P10_1, P10_1_TCPWM_LINE_COMPL7},
    {0u, 2u, P10_3, P10_3_TCPWM_LINE_COMPL2},
    {0u, 3u, P10_5, P10_5_TCPWM_LINE_COMPL3},
    {0u, 4u, P11_1, P11_1_TCPWM_LINE_COMPL4},
    {0u, 5u, P11_3, P11_3_TCPWM_LINE_COMPL5},
    {0u, 6u, P11_5, P11_5_TCPWM_LINE_COMPL6},
    {0u, 7u, P12_1, P12_1_TCPWM_LINE_COMPL7},
};

/* Connections for: tcpwm_tr_in */
/* Since the GPIO pin is not tied to a particular TCPWM resource the channel_num has no value to
   how the connection works. However, the HAL driver needs to know the index of the tcpwm input
   line. Store that in the channel_num field instead. */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_tr_in[7] = {
    {0u, 0u, P0_0, P0_0_TCPWM_TR_IN0},
    {0u, 1u, P0_1, P0_1_TCPWM_TR_IN1},
    {0u, 2u, P1_2, P1_2_TCPWM_TR_IN2},
    {0u, 3u, P1_3, P1_3_TCPWM_TR_IN3},
    {0u, 4u, P2_0, P2_0_TCPWM_TR_IN4},
    {0u, 5u, P2_1, P2_1_TCPWM_TR_IN5},
    {0u, 6u, P3_4, P3_4_TCPWM_TR_IN6},
};

#endif
